---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceSubFolder.FolderName
source: html/33161a20-79d2-2fbb-4fac-5637c91acc98.htm
---
# Autodesk.Revit.DB.ExternalResourceSubFolder.FolderName Property

Folder displayed name.

## Syntax (C#)
```csharp
public string FolderName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null